Ex3/karman-vortex/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	// https://www.openfoam.com/documentation/tutorial-guide/3-compressible-flow/3.1-steady-turbulent-flow-over-a-backward-facing-step
	// boundary condition example
	
	// match all patches beginning with "wall"
	// ("." accepts any char, whereas "*" will accept 0 or more chars) 
	"wall.*"
    {
        type            noSlip;
    }
    
    // assume constant volumetric in and outflow
    "inlet."
    {
        type            fixedValue;
        value			uniform (1.5 0 0);
    }
    
    "|outlet."
    {
		type			zeroGradient;
	}

    "frontAndBack."
    {
        type            empty;
    }
}

// ************************************************************************* //
